#include "head.h"

float alpha;
uint32_t TimeCnt=0;//计时用
int ctrl_flag=0;//定时控制 控制周期0.01s
int function_flag=0;


///////////////////////////////////////////////
/*PID参数赋值
 * [0]->set,[1]->p,[2]->i,
 * [3]->ip,[4]->ii,[5]->id
 */
/*正弦参数赋值
 * s[0]->n
 * s[1]->x_.a,s[2]->x_.h
 * s[3]->y_.a,s[4]->y_.h
 */
float x_p[6]={0,0.05,0.001,1.5,0.001,0.1};
float y_p[6]={0,0.05,0.001,1.5,0.001,0.1};
float s[5]={0,0,0,0,0};

int pwm_duty[4]={0,0,0,0};//PWM波测试用
//////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////
void main(void)
{
    WDT_A_hold(WDT_A_BASE);//关闭看门狗
////////////////////////////////////////////////////
    clk_init();//时钟初始化 时钟频率结构体 clk.
    pwm_init();//PWM波初始化 结构体 pwm_2_x.
    mpu6050_init();//MPU6050信号获得
////////////////////////////////////////////////////
    MAP_Interrupt_enableMaster();//总中断使能
////////////////////////////////////////////////////
    timer_init();//开始计时，周期10ms

    while(1)
    {
        MAP_PCM_gotoLPM0();//去除休眠！！！
//        test();
        if(ctrl_flag==1)
        {
            control();
            ctrl_flag=0;
        }
    }

}

















